#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group]
azurerm_service_plan.main: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.Web/serverfarms/collectiusdemo-asp]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.Storage/storageAccounts/collectiusdemostoracc]
azurerm_kubernetes_cluster.ak8s: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.ContainerService/managedClusters/ak8s]
azurerm_linux_function_app.main: Refreshing state... [id=/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.Web/sites/collectiusdemo-function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.ak8s must be replaced
-/+ resource "azurerm_kubernetes_cluster" "ak8s" {
      ~ api_server_authorized_ip_ranges     = [] -> (known after apply)
      - custom_ca_trust_certificates_base64 = [] -> null
      - enable_pod_security_policy          = false -> null
      ~ fqdn                                = "ak8s-whxhak47.hcp.westus3.azmk8s.io" -> (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/Neo_Collectius_Group/providers/Microsoft.ContainerService/managedClusters/ak8s" -> (known after apply)
      ~ kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      ~ kubernetes_version                  = "1.26.6" -> (known after apply)
      - local_account_disabled              = false -> null
        name                                = "ak8s"
      ~ node_resource_group                 = "MC_Neo_Collectius_Group_ak8s_westus3" -> (known after apply)
      ~ node_resource_group_id              = "/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/MC_Neo_Collectius_Group_ak8s_westus3" -> (known after apply)
      - oidc_issuer_enabled                 = false -> null
      + oidc_issuer_url                     = (known after apply)
      ~ portal_fqdn                         = "ak8s-whxhak47.portal.hcp.westus3.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
        tags                                = {
            "Environment" = "Dev"
        }
        # (12 unchanged attributes hidden)

      ~ default_node_pool {
          - custom_ca_trust_enabled      = false -> null
          - enable_auto_scaling          = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          ~ kubelet_disk_type            = "OS" -> (known after apply)
          - max_count                    = 0 -> null
          ~ max_pods                     = 110 -> (known after apply)
          - min_count                    = 0 -> null
            name                         = "agentpool"
          ~ node_labels                  = {} -> (known after apply)
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = false -> null
          ~ orchestrator_version         = "1.26.6" -> (known after apply)
          ~ os_disk_size_gb              = 128 -> (known after apply)
          ~ os_sku                       = "Ubuntu" -> (known after apply)
          - tags                         = {} -> null
          + workload_runtime             = (known after apply)
          - zones                        = [] -> null
            # (6 unchanged attributes hidden)
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "d5199b24-10b4-45a6-b217-9ec75fd3fca5" -> null
          - tenant_id    = "97ae525f-8017-41a4-a3b4-0095aa735f08" -> null
          - type         = "SystemAssigned" -> null
        }

      - kubelet_identity {
          - client_id                 = "e227e7cb-d4e6-4e38-964d-55027f8a3337" -> null
          - object_id                 = "a67b1d64-320e-4f58-a059-ceb45a23ea9a" -> null
          - user_assigned_identity_id = "/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/MC_Neo_Collectius_Group_ak8s_westus3/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ak8s-agentpool" -> null
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          + docker_bridge_cidr = (known after apply)
          ~ ip_versions        = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode       = (known after apply)
          + network_policy     = (known after apply)
          ~ pod_cidr           = "10.244.0.0/16" -> (known after apply)
          ~ pod_cidrs          = [
              - "10.244.0.0/16",
            ] -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs      = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)

          - load_balancer_profile {
              - effective_outbound_ips      = [
                  - "/subscriptions/1e848775-2b7f-4f89-a40f-4ed805d70e2b/resourceGroups/MC_Neo_Collectius_Group_ak8s_westus3/providers/Microsoft.Network/publicIPAddresses/7df0b5b9-24ca-4cd4-9531-30ec9261513b",
                ] -> null
              - idle_timeout_in_minutes     = 0 -> null
              - managed_outbound_ip_count   = 1 -> null
              - managed_outbound_ipv6_count = 0 -> null
              - outbound_ip_address_ids     = [] -> null
              - outbound_ip_prefix_ids      = [] -> null
              - outbound_ports_allocated    = 0 -> null
            }
        }

      + service_principal {
          + client_id     = (sensitive value) # forces replacement
          + client_secret = (sensitive value)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ client_certificate     = (sensitive value)
  ~ client_key             = (sensitive value)
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_password       = (sensitive value)
  ~ cluster_username       = (sensitive value)
  ~ fqdn                   = "ak8s-whxhak47.hcp.westus3.azmk8s.io" -> (known after apply)
  ~ host                   = (sensitive value)
  ~ kube_config            = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @rvind92, Action: `pull_request`*